<a href="https://colab.research.google.com/github/SoumyadeepDebnath/Data-Engineering/blob/main/91.%20SQL_Basics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## **Concepts**

**[Data Types](https://www.javatpoint.com/sql-data-types)**
*   String 
*   Numeric
*   Date and time Data

####**Primary Key :** *(unique/no duplicate, not null, single column)*

A column or columns is called primary key (PK) that uniquely identifies each row in the table. *A table can contain only one primary key constraint*.

If you want to create a primary key, you should define a PRIMARY KEY constraint when you create or modify a table.

When multiple columns are used as a primary key, it is known as **Composite Primary Key**.

####**Composite Key :** *(unique/no duplicate, not null, single column)*

A composite key is a combination of two or more columns in a table that can be used to uniquely identify each row in the table when *the columns are combined uniqueness is guaranteed, but when it taken individually it does not guarantee uniqueness*.

Sometimes more than one attributes are needed to uniquely identify an entity. A primary key that is made by the combination of more than one attribute is known as a composite key.

In shorts, Composite key is a key which is the combination of more than one field or column of a given table. It may be a candidate key or primary key.

*Columns that make up the composite key can be of different data types.*

In [ ]:
#Single Column
"""
ALTER TABLE table_name 
ADD PRIMARY KEY (column_name);

ALTER TABLE table_name 
DROP PRIMARY KEY (column_name);
"""
#Multiple Column
"""
ALTER TABLE table_name 
ADD CONSTRAINT constraint_name 
PRIMARY KEY (column_name1, column_name2);

ALTER TABLE table_name 
DROP CONSTRAINT constraint_name;
"""

####**Foreign Key(s) :** *(can be duplicate, can be multiple null, single column for one relation)*

In the relational databases, a foreign key is a field or a column that is used to establish a link between two tables.

In simple words you can say that, a foreign key in one table used to point primary key in another table.

In [ ]:

"""
ALTER TABLE table_name1
ADD CONSTRAINT constraint_name 
PRIMARY KEY (primary_key_column_name)
REFERENCES table_name2 (foreign_key_column_name);

ALTER TABLE table_name
DROP FOREIGN KEY constraint_name;
"""

####**Unique Key(s) :** *(unique/no duplicate, can be one null, one or more columns)*

A unique key is a set of one or more than one columns of a table that uniquely identify a record in a database table.

There is an automatically defined unique key constraint within a primary key constraint.

**Comparisons :**
```
The unique key and primary key both provide a guarantee for uniqueness for a column or a set of columns.

> You can say that it is little like primary key but it can accept only one null value and it cannot have duplicate values.
> For one table, there may be many unique key constraints, but only one PRIMARY KEY constraint.

```

In [ ]:
#Single Column
"""
ALTER TABLE table_name 
ADD UNIQUE (column_name);

ALTER TABLE table_name 
DROP UNIQUE (column_name);
"""
#Multiple Column
"""
ALTER TABLE table_name 
ADD CONSTRAINT constraint_name 
UNIQUE (column_name1, column_name2);

ALTER TABLE table_name 
DROP CONSTRAINT constraint_name or DROP INDEX constraint_name;
"""

#### **Alternate Key(s) :** *(unique/no duplicate, not null, one or more columns)*

#### **Candidate Key(s) :** *(unique/no duplicate, not null, one or more columns)*
If a table has more than one candidate key, one of them will become the primary key and rest of all are called alternate keys.

#### **Compound Key :** *()*
The difference between compound and the composite key is that any part of the compound key can be a foreign key, but the composite key may or maybe not a part of the foreign key.

#### **Surrogate Key :** *()*

## **Basic Queries**

#### **Database**

In [ ]:
"""
SHOW DATABASE;
"""

SHOW DATABASE;

In [ ]:
"""
CREATE DATABASE database_name;
"""
	
CREATE DATABASE Company, Student;

In [ ]:
"""
ALTER DATABASE old_database_name MODIFY NAME = new_database_name;  
"""

ALTER DATABASE Student MODIFY NAME = College ;

In [ ]:
"""
DROP DATABASE database_name;
"""
	
DROP DATABASE Company, Student;

`    Cannot drop database "database_name" because it is currently in use.  `

`    Can't drop database 'database_name'; database doesn't exist`

In [ ]:
"""
REPLACE DATABASE database_name;
"""

REPLACE DATABASE Company;

*SQL does not allow developers to create the database with the existing database name. Suppose if you want to create another Student database in the same database system, then the Create Database statement will show the following error in the output:*

`Can't create database 'Student'; database exists`

*So, firstly you have to delete the existing database by using the Drop Statement. You can also replace the existing database with the help of Replace keyword.*

In [ ]:
"""
USE database_name;
"""

USE DATABASE Company;

This SQL statement selects the existing SQL database. Before performing the operations on the database table, you have to select the database from the multiple existing databases.

#### **Table**

In [ ]:
"""
CREATE TABLE table_name
(
column_name1 data_type [column1 constraint(s)],
column_name2 data_type [column2 constraint(s)],
.....,  
column_nameN data_type [columnN constraint(s)],
    [PRIMARY KEY (column_name) or CONSTRAINT constraint_name PRIMARY KEY (column_name1, column_name2);]
    [FOREIGN KEY (foreign_key_column_name) REFERENCES other_table_name (primary_key_column_name)]
    [UNIQUE (column_name) or CONSTRAINT constraint_name UNIQUE (column_name1, column_name2)]
);
"""

CREATE TABLE Employee_details(
    Emp_Id NUMBER(4) NOT NULL,
    First_name VARCHAR(30),
    Last_name VARCHAR(30),
    Salary Money,
    City VARCHAR(30),
    PRIMARY KEY (Emp_Id)
);

In [ ]:
"""
ALTER TABLE table_name ADD column_name datatype [columnN constraint(s)];
ALTER TABLE table_name MODIFY column_name column_datatype;
ALTER TABLE table_name DROP COLUMN column_name;
"""

In [ ]:
"""
DROP TABLE [ IF EXISTS ]
table_name1, table_name2, ……, table_nameN;
"""

DROP TABLE Employee_details, Company_details;

#### **Record / Row**

In [ ]:
"""
INSERT INTO table_name  
(column_name1, column_name2, .…, column_nameN)  
VALUES (value_1, value_2, ..…, value_N), (value_1, value_2, ..…, value_N);
"""

INSERT INTO Employee_details  
(Emp_ID, Name)
VALUES (101, Akhil);

In [ ]:
"""
SELECT column_name1, column_name2, .…, column_nameN
FROM table_name
    [ WHERE condition ]
    [ ORDER BY order_column_name1 [ ASC | DESC ], .... ];
"""

SELECT Emp_ID, First_Name, Last_Name, Salary, City
FROM Employee_details
WHERE Salary = 100000
ORDER BY Last_Name;


"""
SELECT DISTINCT column_name1, column_name2, ...
FROM table_name;
    [ WHERE condition ]
    [ ORDER BY order_column_name1 [ ASC | DESC ], .... ];
"""

SELECT DISTINCT Emp_ID, First_Name, Last_Name, Salary, City
FROM Employee_details

In [ ]:
"""
UPDATE table_name
SET column_name1 = new_value_1, column_name2 = new_value_2, ...., column_nameN = new_value_N  
    [ WHERE  condition ];
"""

UPDATE Employee_details
SET Salary = 100000
WHERE Emp_ID = 10;

In [ ]:
"""
DELETE FROM table_name
WHERE CONDITION;
"""

DELETE FROM Employee_details  
WHERE First_Name = 'Sumit';

In [ ]:
#TRUNCATE TABLE table_name;

TRUNCATE TABLE Employee_details;

## **Joins**
1.   Inner Join
2.   Left Outer Join
3.   Right Outer Join
4.   Outer Join / Full Outer Join
5.   Cross Join

## **Clause**
1.   WHERE
2.   AND
3.   OR
4.   WITH
5.   AS
6.   HAVING
7.   ORDER BY
8.   GROUP BY

In [ ]:
"""
SELECT column1, column 2, ... column n  
FROM    table_name  
WHERE [conditions]

SELECT column_names FROM table_name WHERE condition 1 AND condition 2;

SELECT column_names FROM table_name WHERE condition 1 OR condition 2;
"""

In [ ]:
"""
WITH <alias_name> AS (sql_sub-query_statement)  
SELECT column_list FROM <alias_name> [table name]  
[WHERE <join_condition>]  
When you use multiple sub-query aliases, the syntax will be as follows.

WITH <alias_name_A>  AS (sql_sub-query_statement)  
<alias_name_B> AS (sql_sub-query_statement_from_alias_name_A  
Or sql_sub-query_statement)  
SELECT <column_list>  
FROM <alias_name_A >,< alias_name_B >, [tablenames]  
[WHERE < join_condition>]
"""

In [ ]:
"""
SELECT Column_Name1 AS New_Column_Name, Column_Name2  As New_Column_Name FROM Table_Name;
"""

SELECT day_of_order AS 'Date', Customer As 'Client', Product, Quantity FROM orders;

In [ ]:
SELECT SUM(Emp_Salary), Emp_City FROM Employee GROUP BY Emp_City HAVING SUM(Emp_Salary)>5000;

SELECT COUNT(Roll_No), Age FROM Student_details GROUP BY Age HAVING COUNT(Roll_No) >= 2;

SELECT MIN(Emp_Salary), Emp_Dept FROM Employee GROUP BY Emp_Dept HAVING MIN(Emp_Salary) > 4000;

SELECT MAX(Emp_Salary), Emp_Dept FROM Employee GROUP BY Emp_Dept HAVING MAX(Emp_Salary) < 8000;

SELECT AVG(Emp_Salary), Emp_Dept FROM Employee_Dept GROUP BY Emp_Dept HAVING AVG(Emp_Salary) > 6500;

> The main difference between WHERE & Having clause is that,

the WHERE clause is used to **specify a condition for filtering records before any grouping**. 

while the HAVING clause is used to **specify a condition for filtering values from a group after grouping**.

In [ ]:
"""
can be applicable with multiple columns also (sequentially)
"""

SELECT D_name, D_state, D_salary
FROM developers
ORDER BY D_state DESC; #default ascending order

SELECT D_state, avg(D_salary) AS salary
FROM developers
GROUP BY D_state;

> The main difference between ORDER BY & GROUP By clause is that,

The ORDER BY clause is applicable when we want to get the data based on the **sorting order of one or multiple columns**.

the GROUP BY clause is applicable when we want to get the data based on the **grouping order of one or multiple columns using aggregate function**.

## **Clause**
1.   WHERE
2.   AND
3.   OR
4.   WITH
5.   AS
6.   HAVING